Terraform plan in __Terraform__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.do_challenge will be created
  + resource "digitalocean_kubernetes_cluster" "do_challenge" {
      + auto_upgrade   = true
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + ha             = false
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "do_challenge_cluster"
      + region         = "sfo3"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = true
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.21.5-do.0"
      + vpc_uuid       = (known after apply)

      + maintenance_policy {
          + day        = "sunday"
          + duration   = (known after apply)
          + start_time = "01:00"
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = true
          + id                = (known after apply)
          + max_nodes         = 5
          + min_nodes         = 1
          + name              = "cluster-node-pool"
          + nodes             = (known after apply)
          + size              = "s-2vcpu-4gb"
        }
    }

  # digitalocean_vpc.do_challenege_vpc will be created
  + resource "digitalocean_vpc" "do_challenege_vpc" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = "10.0.0.0/16"
      + name       = "do-challenge-vpc"
      + region     = "sf03"
      + urn        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Create terraform apply for Kubernetes cluster #3](https://github.com/davidjameshowell/do-12-2021-challenge/actions/runs/1561594633)